***********************************************************************
* Licensed Materials - Property of IBM
*
* (c) Copyright IBM Corp. 2026.
*
* US Government Users Restricted Rights - Use, duplication or
* disclosure restricted by GSA ADP Schedule Contract
* with IBM Corp.
***********************************************************************
        PCB    TYPE=DB,DBDNAME=CUSTOMER,PROCOPT=G,KEYLEN=4,            C
               PCBNAME=CUSTOMER
        SENSEG NAME=CUSTOMER,PARENT=0
        PSBGEN PSBNAME=IBGCUDAT,LANG=COBOL
        END