       01 INPUT-AREA.
        05 LL-IN PIC 9(4) USAGE COMP.
        05 ZZ-IN PIC 9(4) USAGE COMP.
        05 TRAN-CODE PIC X(8) USAGE DISPLAY.
        05 IN-CUSTID PIC X(9) USAGE DISPLAY.
